{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "activation": "relu", "padding": "valid", "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_3", "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_1", "units": 256, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "name": "dense_2", "units": 10, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow"}